In [1]:
import pandas as pd
import zipfile,io
import os
import shutil
import requests

In [2]:
# URL of dataset
try:
    url = "http://files.grouplens.org/datasets/movielens/ml-latest.zip"
except:
    print("InvalidURl")

In [4]:
# make directory:
try:
    if not os.path.exists('rawdata'):
        os.makedirs('rawdata', mode=0o777)
    else:
        shutil.rmtree(os.path.join(os.path.dirname(__file__),'rawdata'),ignore_errors=False)
        os.makedirs('rawdata', mode=0o777)
except Exception as e:
    exit()

In [1]:
# Download zipfile
try:
    rzip = requests.get(url)
    zf = zipfile.ZipFile(io.BytesIO(rzip.content))
    rzip.extractall('rawdata')
except Exception as e:
    print(e)

name 'requests' is not defined

In [3]:
#Detecting Anomalies
#Handling Missing Values
df_genome_scores = pd.read_csv('rawdata/genome-scores.csv')

In [4]:
df_genome_scores.isnull().sum()

movieId      0
tagId        0
relevance    0
dtype: int64

In [5]:
df_genome_tags = pd.read_csv('rawdata/genome-tags.csv')

In [6]:
df_genome_tags.isnull().sum()

tagId    0
tag      0
dtype: int64

In [7]:
df_links = pd.read_csv('rawdata/links.csv')

In [8]:
df_links.isnull().sum()

movieId      0
imdbId       0
tmdbId     219
dtype: int64

In [9]:
df_movies = pd.read_csv('rawdata/movies.csv')

In [10]:
df_movies.isnull().sum()

movieId    0
title      0
genres     0
dtype: int64

In [11]:
df_ratings = pd.read_csv('rawdata/ratings.csv')

In [12]:
df_ratings.isnull().sum()

userId       0
movieId      0
rating       0
timestamp    0
dtype: int64

In [13]:
df_tags = pd.read_csv('rawdata/tags.csv')

In [14]:
df_tags.isnull().sum()

userId        0
movieId       0
tag          16
timestamp     0
dtype: int64

In [15]:
df_links[pd.isnull(df_links).any(axis=1)]

       movieId   imdbId  tmdbId
140        142    94878     NaN
598        604   115978     NaN
708        720   118114     NaN
709        721   114103     NaN
718        730   125877     NaN
756        769   116992     NaN
757        770    38426     NaN
778        791   113610     NaN
806        821   112746     NaN
844        859   116536     NaN
1085      1107   102336     NaN
1099      1122   114147     NaN
1110      1133   111357     NaN
1118      1141   113328     NaN
1119      1142   116403     NaN
1132      1155    92281     NaN
1143      1166   113031     NaN
1287      1316   115548     NaN
1387      1421   113212     NaN
1400      1434   123281     NaN
1576      1630   123953     NaN
1650      1709   130073     NaN
1676      1738   120881     NaN
1705      1774   133090     NaN
1717      1789   114322     NaN
1749      1830   119139     NaN
2146      2230   133361     NaN
2174      2258    87690     NaN
2186      2270   109390     NaN
2504      2588   341315     NaN
...        ...      ...     ...
23542   110895  2364066     NaN
23661   111519  3725278     NaN
23719   111722   827425     NaN
23740   111787  2768874     NaN
23820   112163  2670642     NaN
23884   112367  1220553     NaN
23895   112406  3778744     NaN
23928   112493   459131     NaN
23942   112546  1148198     NaN
23960   112606    56593     NaN
24002   112764  2675794     NaN
24004   112770   605145     NaN
24027   112844   386346     NaN
24201   113470  3564534     NaN
24226   113545  2138180     NaN
24250   113636  1765980     NaN
24308   113834  3981072     NaN
24317   113855  1714046     NaN
24346   113972   308188     NaN
24410   114193   444875     NaN
24491   114535   126005     NaN
24591   114895   309807     NaN
24597   114909  4047734     NaN
24608   114963   322250     NaN
24620   115038    88118     NaN
24673   115254    21733     NaN
24775   115715  3670792     NaN
24802   115821  3900116     NaN
28570   128734  4438688     NaN
35278   148093  4006044     NaN

[219 rows x 3 columns]

In [16]:
df_tags[pd.isnull(df_tags).any(axis=1)]

        userId  movieId  tag   timestamp
296397  109583    33826  NaN  1221450908
725819  261188      123  NaN  1199450867
725820  261188      346  NaN  1199451946
725824  261188     1184  NaN  1199452261
725831  261188     1785  NaN  1199452006
725832  261188     2194  NaN  1199450677
725834  261188     2691  NaN  1199451002
725842  261188     4103  NaN  1199451920
725844  261188     4473  NaN  1199451040
725846  261188     4616  NaN  1199452441
725862  261188     7624  NaN  1199452266
725868  261188     8898  NaN  1199450757
725875  261188    32460  NaN  1199450901
725877  261188    33826  NaN  1199450703
725882  261188    36537  NaN  1199450736
725883  261188    55805  NaN  1199450941

In [17]:
df_links.dropna(inplace=True)

In [18]:
df_tags.dropna(inplace=True)

In [19]:
df_links.isnull().sum()

movieId    0
imdbId     0
tmdbId     0
dtype: int64

In [20]:
df_tags.isnull().sum()

userId       0
movieId      0
tag          0
timestamp    0
dtype: int64

In [21]:
df_genome_scores.head()

   movieId  tagId  relevance
0        1      1    0.02475
1        1      2    0.02475
2        1      3    0.04900
3        1      4    0.07750
4        1      5    0.12450

In [22]:
df_genome_tags.head()

   tagId           tag
0      1           007
1      2  007 (series)
2      3  18th century
3      4         1920s
4      5         1930s

In [23]:
df_links.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [24]:
df_movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [25]:
df_ratings.head()

   userId  movieId  rating   timestamp
0       1      110     1.0  1425941529
1       1      147     4.5  1425942435
2       1      858     5.0  1425941523
3       1     1221     5.0  1425941546
4       1     1246     5.0  1425941556

In [26]:
df_tags.head()

   userId  movieId         tag   timestamp
0       1      318    narrated  1425942391
1      20     4306  Dreamworks  1459855607
2      20    89302     England  1400778834
3      20    89302   espionage  1400778836
4      20    89302        jazz  1400778841

In [27]:
# Splitting  title and year

In [28]:
df_movies['year'] = df_movies.title.str.extract("\((\d{4})\)")

/Users/rishabhjain/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: currently extract(expand=None) means expand=False (return Index/Series/DataFrame) but in a future version of pandas this will be changed to expand=True (return DataFrame)
  """Entry point for launching an IPython kernel.

In [29]:
genres_unique = pd.DataFrame(df_movies.genres.str.split('|').tolist()).stack().unique()

In [30]:
genres_unique

array(['Adventure', 'Animation', 'Children', 'Comedy', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Mystery', 'Sci-Fi', 'IMAX', 'Documentary', 'War', 'Musical',
       'Western', 'Film-Noir', '(no genres listed)'], dtype=object)

In [31]:
df_movies = df_movies.join(df_movies.genres.str.get_dummies().astype(int))

In [32]:
df_movies.drop('genres',inplace=True,axis=1)

In [33]:
df_movies.head()

,movieId,title,year,(no genres listed),Action,Adventure,Animation,Children,Comedy,Crime,...,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story (1995),1995,0,0,1,1,1,1,0,...,0,0,0,0,0,0,0,0,0,0
1,2,Jumanji (1995),1995,0,0,1,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0
2,3,Grumpier Old Men (1995),1995,0,0,0,0,0,1,0,...,0,0,0,0,0,1,0,0,0,0
3,4,Waiting to Exhale (1995),1995,0,0,0,0,0,1,0,...,0,0,0,0,0,1,0,0,0,0
4,5,Father of the Bride Part II (1995),1995,0,0,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0

In [34]:
df_ratings.head()

   userId  movieId  rating   timestamp
0       1      110     1.0  1425941529
1       1      147     4.5  1425942435
2       1      858     5.0  1425941523
3       1     1221     5.0  1425941546
4       1     1246     5.0  1425941556

In [35]:
df_ratings.timestamp = pd.to_datetime(df_ratings.timestamp, infer_datetime_format=True)

In [36]:
df_ratings.timestamp = df_ratings.timestamp.dt.year

In [37]:
df_ratings.head()

   userId  movieId  rating  timestamp
0       1      110     1.0       1970
1       1      147     4.5       1970
2       1      858     5.0       1970
3       1     1221     5.0       1970
4       1     1246     5.0       1970

In [38]:
df_genome_tags.isnull().sum()

tagId    0
tag      0
dtype: int64

In [39]:
df_genome_scores.isnull().sum()

movieId      0
tagId        0
relevance    0
dtype: int64

In [40]:
df_tags.isnull().sum()

userId       0
movieId      0
tag          0
timestamp    0
dtype: int64

In [41]:
df_links.isnull().sum()

movieId    0
imdbId     0
tmdbId     0
dtype: int64

In [42]:
df_movies['year'].fillna(0,inplace=True)

In [43]:
df_movies['year'] = df_movies['year'].astype(int)

In [44]:
df_movies.dtypes

movieId                int64
title                 object
year                   int64
(no genres listed)     int64
Action                 int64
Adventure              int64
Animation              int64
Children               int64
Comedy                 int64
Crime                  int64
Documentary            int64
Drama                  int64
Fantasy                int64
Film-Noir              int64
Horror                 int64
IMAX                   int64
Musical                int64
Mystery                int64
Romance                int64
Sci-Fi                 int64
Thriller               int64
War                    int64
Western                int64
dtype: object

In [45]:
df_movies.isnull().sum()

movieId               0
title                 0
year                  0
(no genres listed)    0
Action                0
Adventure             0
Animation             0
Children              0
Comedy                0
Crime                 0
Documentary           0
Drama                 0
Fantasy               0
Film-Noir             0
Horror                0
IMAX                  0
Musical               0
Mystery               0
Romance               0
Sci-Fi                0
Thriller              0
War                   0
Western               0
dtype: int64

In [46]:
df_movies.sort_values(by='movieId', inplace=True)

In [47]:
df_ratings.sort_values(by='movieId', inplace=True)

In [ ]:
df_genome_scores
df_genome_tags
df_tags
df_links
df_movies
df_ratings

In [49]:
# zip the csvs and log files
def zipdir(path,ziph):
    ziph.write(os.path.join('cleansed_df_genome_scores.csv'))
    ziph.write(os.path.join('cleansed_df_genome_tags.csv'))
    ziph.write(os.path.join('cleansed_df_tags.csv'))
    ziph.write(os.path.join('cleansed_df_links.csv'))
    ziph.write(os.path.join('cleansed_df_movies.csv'))
    ziph.write(os.path.join('cleansed_df_ratings.csv'))

In [50]:
df_genome_scores.to_csv('cleansed_df_genome_scores.csv',index = False)
print('1')
df_genome_tags.to_csv('cleansed_df_genome_tags.csv',index = False)
print('2')
df_tags.to_csv('cleansed_df_tags.csv',index = False)
print('3')
df_links.to_csv('cleansed_df_links.csv',index = False)
print('4')
df_movies.to_csv('cleansed_df_movies.csv',index = False)
print('5')
df_ratings.to_csv('cleansed_df_ratings.csv',index = False)
print('6')

1
2
3
4
5
6

In [51]:
zipf = zipfile.ZipFile('CleansedData.zip','w',zipfile.ZIP_DEFLATED)
zipdir('/',zipf)
zipf.close()

### Upload To AWS S3

In [53]:
AWS_ACCESS_KEY_ID = 'AKIAJZDCE55PKZ77K4YA'
AWS_SECRET_ACCESS_KEY = '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'
inputLocation = 'us-east-1'
filepaths='CleansedData.zip'

In [52]:
from boto.s3.key import Key
from boto.s3.connection import S3Connection
import boto.s3
import boto3

In [54]:
def upload_to_s3(Inputlocation,Access_key,Secret_key):            
    print("Uploading files to amazon")
    try:

        buck_name="cleanseddata-files"

        S3_client = boto3.client('s3',Inputlocation,aws_access_key_id= Access_key, aws_secret_access_key= Secret_key)
    
        if Inputlocation == 'us-east-1':
            S3_client.create_bucket(Bucket=buck_name)
        else:
            S3_client.create_bucket(Bucket=buck_name,CreateBucketConfiguration={'LocationConstraint': Inputlocation})

        print("connection successful")
        S3_client.upload_file("CleansedData.zip", buck_name,"CleansedData.zip"),
        #Callback=ProgressPercentage("CleansedData.zip")
    
        print("Files uploaded successfully")
    
    except Exception as e:
        print("Error uploading files to Amazon s3" + str(e))

In [55]:
upload_to_s3(inputLocation,AWS_ACCESS_KEY_ID,AWS_SECRET_ACCESS_KEY)

Uploading files to amazon
connection successful
Files uploaded successfully

### Collaborative Filtering:
### 1.User-User Collaborative Filtering 
### 2.Item-Item Collaborative Filtering

In [48]:
#User-User
import pandas as pd
import numpy as np
import math

In [49]:
df_ratings.head(2)

          userId  movieId  rating  timestamp
4560754    46848        1     4.0       1970
21804638  226491        1     4.0       1970

In [50]:
df_movies.head(2)

,movieId,title,year,(no genres listed),Action,Adventure,Animation,Children,Comedy,Crime,...,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story (1995),1995,0,0,1,1,1,1,0,...,0,0,0,0,0,0,0,0,0,0
1,2,Jumanji (1995),1995,0,0,1,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0

In [51]:
df_tags.head(2)

   userId  movieId         tag   timestamp
0       1      318    narrated  1425942391
1      20     4306  Dreamworks  1459855607

In [52]:
df_ratings_try = df_ratings

In [53]:
df_ratings_try.head(2)

          userId  movieId  rating  timestamp
4560754    46848        1     4.0       1970
21804638  226491        1     4.0       1970

In [54]:
#adjusted ratings
Mean = df_ratings_try.groupby(['userId'],as_index=False,sort=False).mean().rename(columns = {'rating':'rating_mean'})

In [72]:
Mean.head(2)

   userId       movieId  rating_mean  timestamp
0   46848  49973.636054     3.704082     1970.0
1  226491   1002.584270     3.550562     1970.0

In [98]:
df_ratings_try = pd.merge(df_ratings_try,Mean,on='userId',sort = False)

In [99]:
df_ratings_try.head(2)

,userId,movieId_x,rating,timestamp_x,movieId_y,rating_mean_x,timestamp_y,movieId,rating_mean_y,timestamp
0,46848,1,4.0,1970,49973.636054,3.704082,1970.0,49973.636054,3.704082,1970.0
1,46848,70,3.5,1970,49973.636054,3.704082,1970.0,49973.636054,3.704082,1970.0

In [74]:
r1['rating_adjusted'] = r1['rating'] - r1['rating_mean']

In [76]:
r1.head(2)

,userId,movieId_x,rating,timestamp_x,movieId_y,rating_mean,timestamp_y,rating_adjusted
0,46848,1,4.0,1970,49973.636054,3.704082,1970.0,0.295918
1,226491,1,4.0,1970,1002.584270,3.550562,1970.0,0.449438

In [79]:
distinct_users = np.unique(r1['userId'])

In [81]:
user_data_append=pd.DataFrame()

In [83]:
user_data_all=pd.DataFrame()

In [85]:
user1_data= r1[r1['userId']==320]

In [87]:
user1_mean=user1_data['rating'].mean()

In [88]:
user1_data=user1_data.rename(columns={'rating_adjusted':'rating_adjusted1'})

In [89]:
user1_data=user1_data.rename(columns={'userId':'userId1'})

In [90]:
user1_val=np.sqrt(np.sum(np.square(user1_data['rating_adjusted1']),axis=0))

In [93]:
r1.head(2)

,userId,movieId_x,rating,timestamp_x,movieId_y,rating_mean,timestamp_y,rating_adjusted
0,46848,1,4.0,1970,49973.636054,3.704082,1970.0,0.295918
1,226491,1,4.0,1970,1002.584270,3.550562,1970.0,0.449438

In [100]:
distinct_movie=np.unique(['movieId'])

KeyError: 'movieId'

In [101]:
df_movies.head(2)

,movieId,title,year,(no genres listed),Action,Adventure,Animation,Children,Comedy,Crime,...,Film-Noir,Horror,IMAX,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story (1995),1995,0,0,1,1,1,1,0,...,0,0,0,0,0,0,0,0,0,0
1,2,Jumanji (1995),1995,0,0,1,0,1,0,0,...,0,0,0,0,0,0,0,0,0,0

In [106]:
df_ratings.head(2)

          userId  movieId  rating  timestamp
4560754    46848        1     4.0       1970
21804638  226491        1     4.0       1970

In [137]:
n_users = df_ratings.userId.unique().shape[0]

In [138]:
n_movies = df_ratings.movieId.unique().shape[0]

In [139]:
print(str(n_users) + ' users')

270896 users

In [140]:
print(str(n_movies) + ' movies')

45115 movies

### Testing for Collaborative Filtering

In [49]:
df_ratings_try = df_ratings

In [50]:
#adjusted ratings
Mean = df_ratings.groupby(['userId'],as_index=False,sort=False).mean().rename(columns = {'rating':'rating_mean'})

In [51]:
Mean.head(2)

   userId       movieId  rating_mean  timestamp
0   46848  49973.636054     3.704082     1970.0
1  226491   1002.584270     3.550562     1970.0

In [52]:
df_ratings_try1 = pd.merge(df_ratings,Mean[['userId','rating_mean']],on='userId')

In [53]:
df_ratings_try1.head(2)

   userId  movieId  rating  timestamp  rating_mean
0   46848        1     4.0       1970     3.704082
1   46848       70     3.5       1970     3.704082

In [54]:
df_ratings_try1['rating_adjusted'] = df_ratings_try1['rating'] - df_ratings_try1['rating_mean']

In [55]:
df_ratings_try1.head(2)

   userId  movieId  rating  timestamp  rating_mean  rating_adjusted
0   46848        1     4.0       1970     3.704082         0.295918
1   46848       70     3.5       1970     3.704082        -0.204082

In [62]:
# train test split
from sklearn import cross_validation as cv
train_data,test_data = cv.train_test_split(df_ratings_try1,test_size=0.25)

/Users/rishabhjain/anaconda3/lib/python3.6/site-packages/sklearn/cross_validation.py:41: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)

### Memory Based Collaborative Filtering
<b>User-Item filtering</b>A user-item filtering takes a particular user, find users that are similar to that user based on similarity of ratings, and recommend items that those similar users liked.<br> 
<b>Item-Item filtering</b>A item-item filtering will take an item, find users who liked that item, and find other items that those users or similar users also liked. It takes items and outputs other items as recommendations.

In [56]:
df_ratings_try1.head(2)

   userId  movieId  rating  timestamp  rating_mean  rating_adjusted
0   46848        1     4.0       1970     3.704082         0.295918
1   46848       70     3.5       1970     3.704082        -0.204082

In [57]:
df_ratings_try2 = df_ratings_try1[['userId','movieId','rating_adjusted','timestamp']]

In [58]:
df_ratings_try2.head(2)

   userId  movieId  rating_adjusted  timestamp
0   46848        1         0.295918       1970
1   46848       70        -0.204082       1970

In [59]:
df_ratings_try3 = df_ratings_try2[['userId','rating_adjusted']]

In [60]:
df_ratings_try3.set_index('userId',inplace=True)

In [61]:
df_ratings_try3.head(2)

        rating_adjusted
userId
46848          0.295918
46848         -0.204082

In [62]:
from sklearn.preprocessing import MinMaxScaler

In [63]:
scaler = MinMaxScaler()

In [64]:
df_ratings_try3_scaled= pd.DataFrame(scaler.fit_transform(df_ratings_try3),index=df_ratings_try3.index,columns=df_ratings_try3.columns)

In [65]:
df_ratings_try3_scaled.head(2)

        rating_adjusted
userId
46848          0.545365
46848          0.488390

In [66]:
df_ratings_try3_scaled.head(2)

        rating_adjusted
userId
46848          0.545365
46848          0.488390

In [67]:
df_ratings_try3_scaled[['rating_adjusted']] = df_ratings_try3_scaled[['rating_adjusted']].apply(lambda x:5*x)

In [68]:
df_ratings_try3_scaled.head(2)

        rating_adjusted
userId
46848          2.726823
46848          2.441949

In [69]:
df_ratings_try3_scaled['userId'] = df_ratings_try3_scaled.index

In [70]:
df_ratings_try3_scaled = df_ratings_try3_scaled.reset_index(drop=True)

In [71]:
df_ratings_try3_scaled.head(2)

   rating_adjusted  userId
0         2.726823   46848
1         2.441949   46848

In [72]:
df_ratings_try2 = df_ratings_try2.drop('rating_adjusted',axis=1)

In [73]:
df_ratings_try2.head(3)

   userId  movieId  timestamp
0   46848        1       1970
1   46848       70       1970
2   46848      110       1970

In [74]:
df_ratings_try3_scaled.head(3)

   rating_adjusted  userId
0         2.726823   46848
1         2.441949   46848
2         3.296570   46848

In [75]:
df_ratings_try2['rating_adjusted'] = df_ratings_try3_scaled['rating_adjusted']

In [76]:
df_ratings_try2.head(3)

   userId  movieId  timestamp  rating_adjusted
0   46848        1       1970         2.726823
1   46848       70       1970         2.441949
2   46848      110       1970         3.296570

In [77]:
df_ratings_try2['rating'] = df_ratings_try2['rating_adjusted']

In [78]:
df_ratings_try2 = df_ratings_try2.drop('rating_adjusted',axis=1)

In [79]:
df_ratings_try2.head(3)

   userId  movieId  timestamp    rating
0   46848        1       1970  2.726823
1   46848       70       1970  2.441949
2   46848      110       1970  3.296570

In [84]:
# train test split
from sklearn import cross_validation as cv
train_data,test_data = cv.train_test_split(df_ratings_try2,test_size=0.25)

/Users/rishabhjain/anaconda3/lib/python3.6/site-packages/sklearn/cross_validation.py:41: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)

In [85]:
train_data.shape

(19518216, 4)

In [86]:
test_data.shape

(6506073, 4)

In [87]:
n_users = df_ratings_try2.userId.unique().shape[0]
n_movies = df_ratings_try2.movieId.unique().shape[0]
print(str(n_users) + ' users')
print(str(n_movies) + ' movies')

270896 users
45115 movies

In [88]:
import numpy as np

In [89]:
#Create two user-item matrices, one for training and another for testing
train_data_matrix = np.zeros((train_data['userId'].max(), train_data['movieId'].max()))

In [90]:
train_data_matrix.shape

(270896, 176275)

In [91]:
train_data.shape

(19518216, 4)

In [92]:
#train_data
for line in train_data.itertuples():
    train_data_matrix[line[1]-1,line[2]-1] = line[4]

In [93]:
test_data_matrix = np.zeros((train_data['userId'].max(), train_data['movieId'].max()))

In [94]:
for line in test_data.itertuples():
    test_data_matrix[line[1]-1,line[2]-1] = line[4]

In [95]:
train_data.head(5)

          userId  movieId  timestamp    rating
7418358    99739     2514       1970  2.296319
17085337   16353      104       1970  2.597181
23564656  121698      694       1970  2.134226
22739839  242047     1590       1970  2.795619
23996695  254078     1198       1970  2.374434

In [2]:
from sklearn.metrics.pairwise import pairwise_distances

In [3]:
user_similarity = pairwise_distances(train_data_matrix, metric='cosine')

NameError: name 'train_data_matrix' is not defined

In [4]:
item_similarity = pairwise_distances(train_data_matrix.T, metric='cosine')

NameError: name 'train_data_matrix' is not defined

In [98]:
from surprise import SVD
from surprise.model_selection import cross_validate

In [99]:
algo = SVD()

In [105]:
cross_validate(algo, df_ratings_try2.values(), measures=['RMSE', 'MAE'], verbose=True)

AttributeError: 'numpy.ndarray' object has no attribute 'raw_ratings'

In [ ]:
# Ploting movies by year
# Movies by genres
# Movies rating by genre histogram and pie chart
#Average movie rating  per user

In [75]:
year = df_movies['year']

In [77]:
movies = df_movies['movieId'].groupby(year)

In [82]:
pd.Series(year)

0        1995
1        1995
2        1995
3        1995
4        1995
5        1995
6        1995
7        1995
8        1995
9        1995
10       1995
11       1995
12       1995
13       1995
14       1995
15       1995
16       1995
17       1995
18       1995
19       1995
20       1995
21       1995
22       1995
23       1995
24       1995
25       1995
26       1995
27       1995
28       1995
29       1995
         ...
45812    2010
45813    2010
45814    2017
45815    2015
45816    1944
45817    2007
45818    2002
45819    1905
45820    1901
45821    1905
45822    1906
45823    1909
45824    1904
45825    1904
45826    2005
45827    1900
45828    1900
45829    1981
45830    2017
45831    2015
45832    1972
45833    1946
45834    2000
45835    2000
45836    1995
45837    1991
45839    2011
45840    2003
45841    1917
45842    2017
Name: year, Length: 45656, dtype: object

In [83]:
type(year)

pandas.core.series.Series

In [ ]:
# Simple Popularity Model

In [86]:
df_ratings.head()

          userId  movieId  rating  timestamp
4560754    46848        1     4.0       1970
21804638  226491        1     4.0       1970
21804572  226490        1     5.0       1970
11662860  121018        1     2.0       1970
2888413    30092        1     3.0       1970

In [115]:
a = df_ratings.groupby('movieId')['rating'].sum()

In [117]:
b = df_ratings.groupby('movieId').sum()

In [118]:
b

             userId    rating  timestamp
movieId
1        8919069847  256649.5  130035760
2        3514919475   84355.0   51338200
3        2115657456   49211.5   30529090
4         406159867    8572.5    5872570
5        2064304803   46988.0   30058260
6        3778217046  107166.0   54953150
7        2041425334   51111.0   29859290
8         205842764    4759.5    2996370
9         591538986   13306.0    8713310
10       4379389456  111651.5   64091980
11       2638767198   71290.0   38365750
12        600372959   11958.0    8815750
13        249426441    6114.0    3620860
14        920467127   23353.5   13409790
15        422147772    8522.0    6156250
16       2766971279   77872.5   40418490
17       3274885406   96007.5   47855240
18        830364791   20761.0   11997300
19       3266821645   63774.0   47697640
20        619708861   13373.5    9103370
21       3437458637   91114.5   50248790
22       1482527139   36392.5   21721220
23        651563583   15144.0    9448120
24       1240896587   29040.0   17988070
25       3324067170   90290.5   48499430
26        411932437   10900.0    5941520
27        250605876    6336.0    3644500
28        460622739   13727.5    6694060
29       1329845371   38805.0   19497090
30        181364913    4928.0    2669350
...             ...       ...        ...
176205        35192       3.0       1970
176207        24217       0.5       1970
176211      2281296      64.0      33490
176213        87865       3.5       1970
176215        77179       1.5       1970
176217       258955       5.0       1970
176219       995329      20.0      13790
176221       189131       2.5       1970
176223       189131       4.0       1970
176225       189131       3.0       1970
176227       189131       3.0       1970
176229       189131       2.5       1970
176231       189131       2.5       1970
176233       189131       2.0       1970
176235       190507       1.5       1970
176237       189131       3.0       1970
176239       228940       7.5       3940
176245       106988       4.5       1970
176249       213846       7.0       3940
176251       235828       2.0       1970
176253       107291       4.5       1970
176255        77179       2.0       1970
176257       189131       3.0       1970
176259       189131       3.5       1970
176263       189131       2.0       1970
176267       189131       4.0       1970
176269        97528       3.5       1970
176271          837       5.0       1970
176273       267799       1.0       1970
176275       178373       3.0       1970

[45115 rows x 3 columns]

In [116]:
a

movieId
1         256649.5
2          84355.0
3          49211.5
4           8572.5
5          46988.0
6         107166.0
7          51111.0
8           4759.5
9          13306.0
10        111651.5
11         71290.0
12         11958.0
13          6114.0
14         23353.5
15          8522.0
16         77872.5
17         96007.5
18         20761.0
19         63774.0
20         13373.5
21         91114.5
22         36392.5
23         15144.0
24         29040.0
25         90290.5
26         10900.0
27          6336.0
28         13727.5
29         38805.0
30          4928.0
            ...
176205         3.0
176207         0.5
176211        64.0
176213         3.5
176215         1.5
176217         5.0
176219        20.0
176221         2.5
176223         4.0
176225         3.0
176227         3.0
176229         2.5
176231         2.5
176233         2.0
176235         1.5
176237         3.0
176239         7.5
176245         4.5
176249         7.0
176251         2.0
176253         4.5
176255         2.0
176257         3.0
176259         3.5
176263         2.0
176267         4.0
176269         3.5
176271         5.0
176273         1.0
176275         3.0
Name: rating, Length: 45115, dtype: float64

In [ ]:
# top 10 recommendation
def top10movies(year):